Revit 2024 API
CurveExtents Class
 Represents the start and end parameters for a curve segment.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public class CurveExtents : IDisposable
Visual Basic
Public Class CurveExtents _
	Implements IDisposable
Visual C++
public ref class CurveExtents : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.CurveExtents
See Also
CurveExtents Members
Autodesk.Revit.DB Namespace